<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"1cb54c8919d617017ca6f88af99199b7686e82bce83eafbb7a3de2404f0c4268","plan_job_ref":"Job Test plan target and replace #409 at https://github.com/dflook/terraform-github-actions/actions/runs/7849269833","plan_out_hash":"7e9451c4ac181e68a330c8adb552adc7eefbb3e494b9e24318be5b3083048e3b","plan_hash":"8d1a780a2d6b161f98c84efb06b6df35ce026b29fce673975f0a64171a47f74e","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "TER0pFvWyR" -> (known after apply)
!~  foreach = "Rv4qN0tg4L" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #409](https://github.com/dflook/terraform-github-actions/actions/runs/7849269833)